{"format": "layers-model", "generatedBy": "keras v2.2.5", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.5", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 512], "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "tanh"}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "mean_squared_error", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [512, 512], "dtype": "float32", "quantization": {"min": -0.8383873154135312, "scale": 0.006351419056163115, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.794068218796861, "scale": 0.00336469584235958, "dtype": "uint8"}}, {"name": "dense_2/kernel", "shape": [512, 512], "dtype": "float32", "quantization": {"min": -1.0559216380119325, "scale": 0.006901448614457075, "dtype": "uint8"}}, {"name": "dense_2/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.886403341795884, "scale": 0.004200963705193763, "dtype": "uint8"}}, {"name": "dense_3/kernel", "shape": [512, 512], "dtype": "float32", "quantization": {"min": -0.8489906647626091, "scale": 0.006152106266395718, "dtype": "uint8"}}, {"name": "dense_3/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -1.1346792632458256, "scale": 0.006447041268442191, "dtype": "uint8"}}, {"name": "dense_4/kernel", "shape": [512, 512], "dtype": "float32", "quantization": {"min": -1.0662902509464938, "scale": 0.006384971562553855, "dtype": "uint8"}}, {"name": "dense_4/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -1.060201990253785, "scale": 0.004712008845572378, "dtype": "uint8"}}, {"name": "dense_5/kernel", "shape": [512, 512], "dtype": "float32", "quantization": {"min": -0.9699812994283789, "scale": 0.006100511317159616, "dtype": "uint8"}}, {"name": "dense_5/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.7753345370292664, "scale": 0.0027026556286157345, "dtype": "uint8"}}, {"name": "dense_6/kernel", "shape": [512, 512], "dtype": "float32", "quantization": {"min": -0.08412737253249859, "scale": 0.0006730189802599888, "dtype": "uint8"}}, {"name": "dense_6/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.019666308559039062, "scale": 0.00015485282329952017, "dtype": "uint8"}}]}]}